WHeiu/Uav-control-module/开发/src/Stm32_New_Program/Src/MPU9250/invmpuu.c
	}
	return 0;
}
//得到dmp处理后的数据(注意,本函数需要比较多堆栈,局部变量有点多)
//pitch:俯仰角 精度:0.1°   范围:-90.0° <---> +90.0°
//roll:横滚角  精度:0.1°   范围:-180.0°<---> +180.0°
//yaw:航向角   精度:0.1°   范围:-180.0°<---> +180.0°
//返回值:0,正常
//    其他,失败
uint8_t mpu_dmp_get_data(float *pitch,float *roll,float *yaw)
{
	float q0=1.0f,q1=0.0f,q2=0.0f,q3=0.0f;
	unsigned long sensor_timestamp;
	short gyro[3], accel[3], sensors;
	unsigned char more;
	long quat[4]; 
	if(dmp_read_fifo(gyro, accel, quat, &sensor_timestamp, &sensors,&more))return 1;	 
	/* Gyro and accel data are written to the FIFO by the DMP in chip frame and hardware units.
	 * This behavior is convenient because it keeps the gyro and accel outputs of dmp_read_fifo and mpu_read_fifo consistent.
	**/
	/*if (sensors & INV_XYZ_GYRO )
	send_packet(PACKET_TYPE_GYRO, gyro);
	if (sensors & INV_XYZ_ACCEL)
	send_packet(PACKET_TYPE_ACCEL, accel); */
	/* Unlike gyro and accel, quaternions are written to the FIFO in the body frame, q30.
	 * The orientation is set by the scalar passed to dmp_set_orientation during initialization. 
	**/
	
	if(sensors&INV_WXYZ_QUAT) 
	{
		q0 = quat[0] / q30;	//q30格式转换为浮点数
		q1 = quat[1] / q30;
		q2 = quat[2] / q30;
		q3 = quat[3] / q30; 
		//计算得到俯仰角/横滚角/航向角
		*pitch = asin(-2 * q1 * q3 + 2 * q0* q2)* 57.3;	// pitch
		*roll  = atan2(2 * q2 * q3 + 2 * q0 * q1, -2 * q1 * q1 - 2 * q2* q2 + 1)* 57.3;	// roll
		*yaw   = atan2(2*(q1*q2 + q0*q3),q0*q0+q1*q1-q2*q2-q3*q3) * 57.3;	//yaw
	}else return 2;
	return 0;
}

//得到mpl处理后的数据(注意,本函数需要比较多堆栈,局部变量有点多)
//pitch:俯仰角 精度:0.1°   范围:-90.0° <---> +90.0°
//roll:横滚角  精度:0.1°   范围:-180.0°<---> +180.0°
//yaw:航向角   精度:0.1°   范围:-180.0°<---> +180.0°
//返回值:0,正常
//    其他,失败
uint8_t mpu_mpl_get_data(float *pitch,float *roll,float *yaw)
{
	unsigned long sensor_timestamp;
	unsigned long long timestamp;
	short gyro[3], accel_short[3],compass_short[3],sensors;
	unsigned char more;
	long compass[3],accel[3],quat[4],temperature; 
    long data[9];
	
	char compass_buf[30]={0};
		char compass_buf1[30]={0};
			char compass_buf2[30]={0};
			
    int8_t accuracy;

	if(dmp_read_fifo(gyro, accel_short, quat, &sensor_timestamp, &sensors,&more))return 1;	 

    if(sensors&INV_XYZ_GYRO)
    {
			printff(USART3, "\r\nSEND GYRO\r\n", strlen("\r\nSEND GYRO\r\n"));
        inv_build_gyro(gyro,sensor_timestamp);          //把新数据发送给MPL
        mpu_get_temperature(&temperature,&sensor_timestamp);
        inv_build_temp(temperature,sensor_timestamp);   //把温度值发给MPL，只有陀螺仪需要温度值
    }
    
    if(sensors&INV_XYZ_ACCEL)
    {
			printff(USART3, "\r\nSEND ACCEL\r\n", strlen("\r\nSEND ACCEL\r\n"));
        accel[0] = (long)accel_short[0];
        accel[1] = (long)accel_short[1];
        accel[2] = (long)accel_short[2];
        inv_build_accel(accel,0,sensor_timestamp);      //把加速度值发给MPL
    }
    
    if (!mpu_get_compass_reg(compass_short, &sensor_timestamp)) 
    {
			printff(USART3, "\r\nget compass ok\r\n", strlen("\r\nget compass ok\r\n"));
        compass[0]=(long)accel[0];
        compass[1]=(long)accel[1];
        compass[2]=(long)accel[2];
        inv_build_compass(compass,0,sensor_timestamp); //把磁力计值发给MPL
    }
		
		sprintf(compass_buf,"%ld",compass[0]);
		sprintf(compass_buf1,"%ld",compass[1]);
		sprintf(compass_buf2,"%ld",compass[2]);
	  printff(USART3, "--------------------------------\r\n", strlen("--------------------------------\r\n"));
		printff(USART3, compass_buf,strlen(compass_buf));	 
    printff(USART3, "\r\n", strlen("\r\n"));		
		printff(USART3, compass_buf1,strlen(compass_buf1));
		printff(USART3, "\r\n", strlen("\r\n"));
		printff(USART3, compass_buf2,strlen(compass_buf2));
		printff(USART3, "\r\n--------------------------------\r\n", strlen("\r\n--------------------------------\r\n"));
		
    inv_execute_on_data();
    inv_get_sensor_type_euler(data,&accuracy,&timestamp);
		
		
    
////		    long ltest=437825;
////				char strlong[4]; 
//				long* temp = &accel[0]; 
//				int i; 

//				for(i=0;i<4;i++)
//				{
//				   TEST_BUF[i]=(char)*temp; 
//				   temp++;
//				}
//		memcpy(TEST_BUF,&accel,20);
					
    *roll  = (data[0]/q16);
    *pitch = -(data[1]/q16);
    *yaw   = -data[2] / q16;
	return 0;
}

